e1=0
e2=0
e3=0
for i in range(1,2001,1):
    product=raw_input("Δώσε Κωδικό Προιόντος (Ε1,Ε2,Ε3) : ")
    if product=="E1":
        e1=e1+1
    elif product=="E2":
        e2=e2+1
    elif product=="E3":
        e3=e3+1
if e1<100:
    print "Το προιόν Ε1 έχει λιγότερο από 100 τεμάχια και πρέπει να γίνει παραγγελία"
if e2<100:
    print "Το προιόν Ε2 έχει λιγότερο από 100 τεμάχια και πρέπει να γίνει παραγγελία"
if e3<100:
    print "Το προιόν Ε3 έχει λιγότερο από 100 τεμάχια και πρέπει να γίνει παραγγελία"